package controller;

import org.springframework.stereotype.Controller;

/**
 * Created by ldchao on 2017/11/5.
 */
@Controller
public class ConsultantController {


    //根据gid获取所有外籍顾问列表

    //根据外籍顾问id增加一条预约记录

    //根据pid获取所有服务顾问列表

    //根据服务顾问id增加一条预约记录

    //******************后台管理接口**********************

    //#################外籍顾问##################

    //根据gid增加一条外籍顾问信息

    //根据id编辑一条外籍顾问信息

    //根据id删除一条外籍顾问信息

    //根据外籍顾问id获得该顾问所有未答复的预约

    //根据外籍顾问id获得该顾问所有已经打发的预约

    //根据外籍顾问预约id答复某条预约

    //根据外籍顾问预约id删除某条预约

    //根据外籍顾问id将某条外籍顾问添加到重点推荐列表中

    //#################服务顾问#####################

    //根据pid增加一条服务顾问信息

    //根据id编辑一条服务顾问信息

    //根据id删除一条服务顾问信息

    //根据服务顾问id获得该顾问所有未答复的预约

    //根据服务顾问id获得该顾问所有已经打发的预约

    //根据服务顾问预约id答复某条预约

    //根据服务顾问预约id删除某条预约

    //根据服务顾问id将某条服务顾问添加到重点推荐列表中

    //*******************共同接口**************************

    //根据id编辑某条重点推荐顾问信息

    //根据id删除某条重点推荐顾问信息

}
