package controller;

import org.springframework.stereotype.Controller;

/**
 * Created by ldchao on 2017/11/2.
 */
@Controller
public class ProfessionController {

    //获取所有国家

    //根据国家和大分类获取所有小分类

    //根据分类（pid）、专业课程、申请建议信息

    //根据pid获取该专业所有专业方向及相关课程列表

    //根据pid获取该专业所有就业去向列表

    //根据pid获取该专业所有就业岗位列表

    //根据pid获取该专业所有就业薪资列表

    //根据pid获取该专业所有申请条件列表

    //根据pid获取该专业所有院校排名列表

    //根据pid获取该专业所有成功案例列表

    //***********************后台管理接口******************************

    //在某个国家和大专业下增加一个小专业

    //在pid下增加一条专业详情介绍+专业课程介绍+独家申请建议（每个pid只能由一条）

    //根据pid修改某条专业详情介绍+专业课程介绍+独家申请建议

    //根据pid删除某条专业详情介绍+专业课程介绍+独家申请建议

    //根据pid获取草稿状态的专业详情介绍+专业课程介绍+独家申请建议

    //在pid下增加一条课程

    //在pid下修改一条课程

    //在pid下删除一条课程

    //在pid下增加一条就业去向

    //在pid下修改一条就业去向

    //在pid下删除一条就业去向

    //在pid下增加一条就业岗位

    //在pid下修改一条就业岗位

    //在pid下删除一条就业岗位

    //在pid下增加一条就业薪资

    //在pid下修改一条就业薪资

    //在pid下删除一条就业薪资

    //在pid下增加一条申请条件

    //在pid下修改一条申请条件

    //在pid下删除一条申请条件



}
